app/views/users/index.html.erb

	<tr>
		<td><%= image_tag p.image.photo(:thumb) if !p.image.blank?%></td>
---
SELECT  "images".* FROM "images" WHERE "images"."user_id" = ? LIMIT 1  [["user_id", 1]]