app/controllers/products_controller.rb

  def index
  @product=Product.all
---
SELECT "products".* FROM "products"

def create
  image_object=product_params[:image]
  product_params.delete(:image)
  @product = Product.new(product_params)
   if @product.save
    image_object[:photo].map { |img|
      Image.create(:photo=>img, :entity_type=>@product.class.name, :entity_id=>@product.id)
---
INSERT INTO "products" ("name", "brand_name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ashish"], ["brand_name", "Jain"], ["price", "50 rs"], ["created_at", "2015-07-29 16:55:35.077002"], ["updated_at", "2015-07-29 16:55:35.077002"]]
INSERT INTO "images" ("photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "entity_type", "entity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)