app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @user=User.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["email", ""], ["password", ""], ["created_at", "2015-08-01 06:21:56.223083"], ["updated_at", "2015-08-01 06:21:56.223083"]]
---
def create
  @user = User.new(user_params)
   if @user.save